## Introduction
### Description
The first step in any data project is to understand and prepare the data. Otherwise, any analysis or model will be unreliable.

Goals of the data cleaning phase:
- Load the data correctly with column names
- Handle missing values
- Clean up string columns (remove whitespace)
- Understand data types (categorical vs numerical)
- Prepare a "clean" dataset for analysis and modeling

### Data Content & File Descriptions
#### adult.data
The main training dataset (32,561 rows), each row represents an individual with demographic and income info
NOTE: no header row, column names are provided separately

#### adult.names
Documentation file containing column names and descriptions of each attribute
NOTE: does not contain data

#### adult.test
Separate test dataset for evaluation

### Plan
1. Load data & assign column name. The .data file has no header
2. Explore data with df.head() and df.info()
3. Check for missing values
4. Drop or impute missing values
5. Strip whitespace from string columns to avoid errors during encoding/analysis
6. Confirm data types. Which ones are categorical versus numerical?
7. Save the cleaned data

### Imports

In [24]:
import pandas as pd
import numpy as np

### Load Data & Assign Column Names

In [25]:
# column names from adult.names file
column_names = [
    "age", "workclass", "fnlwgt", "education", "education_num", 
    "marital_status", "occupation", "relationship", "race", "sex", 
    "capital_gain", "capital_loss", "hours_per_week", "native_country", "income"
]

# load the dataset
df = pd.read_csv(
    "adult/adult.data", 
    names=column_names, 
    sep=',', 
    na_values='?',           # Treat '?' as NaN
    skipinitialspace=True    # Skip whitespace after commas
)

# Display first 10 rows
df.head(10)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K

### Explore the Data

In [26]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       30725 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education_num   32561 non-null  int64
 5   marital_status  32561 non-null  object
 6   occupation      30718 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital_gain    32561 non-null  int64
 11  capital_loss    32561 non-null  int64
 12  hours_per_week  32561 non-null  int64
 13  native_country  31978 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

### Check for Missing Values
Missing values were represented as `?` in the raw dataset but were converted to `NaN` in a previous cell

In [27]:
# count the null values
df.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education_num        0
marital_status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital_gain         0
capital_loss         0
hours_per_week       0
native_country     583
income               0
dtype: int64

### Drop Missing Values

In [28]:
# create a clean copy of our dataframe
df_clean = df.dropna().copy()

# confirm shape of cleaned dataset
print(f"Original dataset shape: {df.shape}")
print(f"Cleaned dataset shape: {df_clean.shape}")

# confirm no missing values remain
df_clean.isnull().sum()

Original dataset shape: (32561, 15)
Cleaned dataset shape: (30162, 15)

age               0
workclass         0
fnlwgt            0
education         0
education_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

### Strip Whitespace

In [29]:
# identify string columns, "object" columns are strings here
string_columns = df_clean.select_dtypes(include='object').columns

# for each column, strip the whitespace
for col in string_columns:
    df_clean[col] = df_clean[col].str.strip()

# confirm unique values in a few key columns to verify cleaning
print("Unique workclass values:", df_clean['workclass'].unique())
print("Unique native_country values:", df_clean['native_country'].unique())
print("Unique income values:", df_clean['income'].unique())

Unique workclass values: ['State-gov' 'Self-emp-not-inc' 'Private' 'Federal-gov' 'Local-gov'
 'Self-emp-inc' 'Without-pay']
Unique native_country values: ['United-States' 'Cuba' 'Jamaica' 'India' 'Mexico' 'Puerto-Rico'
 'Honduras' 'England' 'Canada' 'Germany' 'Iran' 'Philippines' 'Poland'
 'Columbia' 'Cambodia' 'Thailand' 'Ecuador' 'Laos' 'Taiwan' 'Haiti'
 'Portugal' 'Dominican-Republic' 'El-Salvador' 'France' 'Guatemala'
 'Italy' 'China' 'South' 'Japan' 'Yugoslavia' 'Peru'
 'Outlying-US(Guam-USVI-etc)' 'Scotland' 'Trinadad&Tobago' 'Greece'
 'Nicaragua' 'Vietnam' 'Hong' 'Ireland' 'Hungary' 'Holand-Netherlands']
Unique income values: ['<=50K' '>50K']

### Confirm Data Types
Numerical data is classified as an int or float, columns listed as objects are strings, and thus are categorical variables.

In [30]:
df_clean.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education_num      int64
marital_status    object
occupation        object
relationship      object
race              object
sex               object
capital_gain       int64
capital_loss       int64
hours_per_week     int64
native_country    object
income            object
dtype: object

### Save the Data

In [31]:
df_clean.to_csv("adult_clean.csv", index=False)

# confirm save
df_check = pd.read_csv("adult_clean.csv")
print(f"Reloaded cleaned dataset shape: {df_check.shape}")

Reloaded cleaned dataset shape: (30162, 15)